//!Задача №5
// З клавіатури вводиться назва категорії водія (А-мотоцикл, В-легковий автомобіль, С-вантажний автомобіль). Вивести на екран назву транспортного засобу, яким він може керувати.
let rightsСategory = prompt(
  "Введіть категорію прав (А-мотоцикл, В-легковий автомобіль, С-вантажний автомобіль)"
);
let result;

switch (rightsСategory.toUpperCase()) {
  case "A":
    result = "Мотоцикл";
    break;
  case "B":
    result = "Легковий автомобіль";
    break;
  case "C":
    result = "Вантажний автомобіль";
    break;

  default:
    result = "Інша категорія";
    break;
}

alert(result);
