//!Задача №4
// З клавіатури вводиться вік людини. Вивести на екран ким він є (дитиною у садочку, школярем, студентом, працівником, пенсіонером).
let userAge = parseInt(prompt("Скільки вам років?"));
let result;

if (userAge <= 5) {
  result = "Ви ще зовсім маленький, ви ходите в садочок";
} else if (userAge <= 17 && userAge >= 6) {
  result = "Мені б повернути мої шкільні роки..";
} else if (userAge <= 24 && userAge >= 18) {
  result = "Привіт, студент :)";
} else if (userAge <= 59 && userAge >= 25) {
  result = "Ого, ви вже рубаєте бабло!";
} else if (userAge >= 60) {
  result = "Цікавого і легкого пенсіонерського життя вам!";
} else {
  result = "Дані введені не коректно";
}
alert(result);
