//!Задача №5
// На екрані виводиться меню:
// 1. Сказати «Привіт».
// 2. Сказати «Зачекай».
// 3. Сказати «До побачення».
// 4. Вихід.
// Шляхом вибору пунктів меню виводити відповідні повідомлення, поки не буде вибрано пункт номер 4.
let menuWithItems = 0;
do {
  menuWithItems = parseInt(
    prompt(
      "1. Сказати «Привіт».\n2. Сказати «Зачекай».\n3. Сказати «До побачення».\n4. Вихід."
    )
  );
  let res;
  switch (menuWithItems) {
    case 1:
      res = "Привіт";
      break;
    case 2:
      res = "Зачекай";
      break;
    case 3:
      res = "До побачення";
      break;
    case 4:
      res = "Вихід";
      break;
  }
  alert(`Ви обрали: ${res}`);
} while (menuWithItems !== 4);
